https://utahavalanchecenter.org/forecast/salt-lake/json/json.json

{
  "advisories": [
    {
      "advisory": {
        "date_issued": "Sunday, December 30, 2018 - 3:56am",
        "date_issued_timestamp": "1546167363",
        "special_announcement": "\rThe new UAC&nbsp;IOS mobile app is now available on the app store. Check out the new \"My Weather\" feature.&nbsp;\r\r\r\r&nbsp;\r\r",
        "general_announcements": "\rCLICK HERE FOR MORE GENERAL INFO AND FAQ\r&nbsp;\r\rThis information does not apply to developed ski areas or highways where avalanche control is normally done. This forecast&nbsp;is from the U.S.D.A. Forest Service, which is solely responsible for its content. This forecast&nbsp;describes general avalanche conditions and local variations always occur.\r\r",
        "current_conditions": "Skies are overcast and mountain temperatures are in the teens. Winds are westerly, averaging in the teens with gusts in the 20's and 30's mph above 9000', with very strong winds gusting in the 60's mph at 11,000' Winds will be out of the west\/southwest this morning, shifting to the northwest this afternoon as a cold front moves through the Wasatch range. Wind speeds will be on the increase today, especially by early afternoon.&nbsp;At mid elevations winds will be averaging in the teens and 20's mph, with stronger gusts in the 30's mph; upper elevations will gust into the 40's and 50's. Winds will remain strong through the afternoon, and begin to diminish by about sunset.\r\rLight snowfall is forecasted this morning, with riming possible. Things get interesting by mid-afternoon when a sharp&nbsp;cold front crashes through the Salt Lake mountains, followed by a period of a cold, northwest flow! Snowfall rates could reach 2-3\"\/hour for a short duration later this afternoon, with continued snowfall on a northwest flow into the overnight hours. Snow showers may linger into Monday morning in zones favored by a northwest flow, such as Little Cottonwood. The mountains should receive 5-10\" of very low-density snowfall by the time this system wraps up.\r\r2018 will conclude - and we'll greet 2019 -&nbsp;&nbsp;with some the coldest temperatures of our young winter season.&nbsp;\r",
        "mountain_weather": "We will enjoy cold, clear conditions into midweek, with a warm-up and ridging later this week and into the weekend. The models are currently forecasting a warm, moist westerly flow about 7 days out. Right now it may be more of a southern Utah event, but there exists the potential for moisture statewide.\r\r\r\r\r&nbsp;\r\rTo get help in an emergency (to request a rescue) in the Wasatch, call 911.&nbsp;Be prepared to give your GPS coordinates or the run name. Dispatchers have a copy of the&nbsp;Wasatch Backcountry Ski map.\r\r&nbsp;\r\rBackcountry Emergencies. (clickable link)It outlines your step-by-step method in the event of a winter backcountry incident.\r\r&nbsp;\r\rIf you trigger an avalanche&nbsp;in the backcountry, but no one is hurt and you do not need assistance, please notify the nearest ski area dispatch to avoid a needless response by rescue teams. Thanks.\r\r&nbsp;\r\r\r\rSalt Lake and Park City&nbsp;– Alta Central (801-742-2033), Canyons Resort\/PCMR Dispatch&nbsp;(435-615-1911)\r\rOgden&nbsp;- Snowbasin Resort Dispatch (801-620-1017), Powder Mountain Dispatch (801-745-3772&nbsp;x 123)\r\rProvo&nbsp;- Sundance Dispatch (801-223-4150)\r\r\r\r\r",
        "recent_activity": "&nbsp;\r\r\rThree skier-triggered wind slab avalanches were reported from Saturday, with two of the avalanches breaking 20-30' above the rider. These were hard slabs that formed during the period of moderate to strong east\/northeast winds Thursday and Friday. One slide in the Bonanza Flats area was only 3-6\" thick and 30' wide, but it quickly gained momentum on the steep slope and ran a reported 600' vertical (observation). [Photo JP Gendron]\r\r\r\r&nbsp;\r\rA small, soft slab avalanche was also reported in Wolverine Cirque, burying a rider up to his waist (observation). Otherwise, sluffing&nbsp;in the weakening snow surface was reported on steep northerly aspects. Be sure to read Mark White's observation (including excellent photos) of sluffing in the snow surface along the Park City ridgeline&nbsp;by clicking here.&nbsp;\r\r",
        "avalanche_problem_1": "Wind Drifted Snow",
        "avalanche_problem_1_description": "Wind slabs that formed on all aspects at the mid and upper elevations during the east\/northeast wind loading event Thursday night and early Friday morning remained sensitive&nbsp;on Saturday. Many of these hard wind slabs are sitting on weak, low-density snowfall that fell earlier this past week, and some may still be reactive today. Additionally, today's &nbsp;winds will quickly create fresh wind slabs on all aspects at the mid and upper elevations, especially as winds increase mid-day. These drifts may form on top of weaker snow that currently sits on our snow surface, possibly making them particularly sensitive to a rider.\r\rAlthough I am not expecting winds to get into low elevation terrain today, watch for changing conditions, especially as the terrain can funnel and channel winds well down into drainages.\r\rLight snowfall is forecasted through much of the day, with the heaviest snowfall expected to begin around 3 pm. Pay careful attention to increasing snowfall rates as the new snow may quickly form sensitive soft slabs and shallow, long-running sluffing&nbsp;in the loose snow.&nbsp;\r",
        "avalanche_problem_2": "Persistent Weak Layer",
        "avalanche_problem_2_description": "\rIn isolated areas (thinner snowpack&nbsp;areas or terrain that has previously avalanched this season), human triggered avalanches 1-3' deep may again run on weak, sugary, faceted snow down near the ground.&nbsp; These areas are generally on northwest to east facing terrain above about 9000'.&nbsp; Today's forecasted&nbsp;winds may quickly load some of the slopes where this weaker snowpack structure exists, creating the possibility for larger avalanches breaking down near the ground.\r\r",
        "avalanche_problem_3_description": "\r&nbsp;\r\r",
        "bottom_line": "The avalanche hazard will rise to CONSIDERABLE on upper elevation aspects facing north, east, and south as westerly winds increase throughout the day. Upper elevation westerly aspects, as well as all mid elevation aspects, have a MODERATE hazard.&nbsp; The primary avalanche hazard today will be fresh wind slabs, particularly as wind speeds increase in the early afternoon. Also watch for sensitive soft slabs and long-running sluffs&nbsp;in the new snow, especially as snowfall rates increase later this afternoon.&nbsp;&nbsp;\r\r\r\rPractice safe travel protocol:&nbsp;Travel one at a time in avalanche terrain, keep your partner in sight and be in position to get to them quickly should there be an avalanche.\r\r",
        "danger_rose_1": "16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,14,14,14,14,14,14,14,14",
        "danger_rose_2": "16,16,16,14,14,14,14,16,14,14,14,14,14,14,14,14,14,14,14,14,14,14,14,14",
        "danger_rose_3": "14,14,14,14,14,14,14,14,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0",
        "overall_danger_rose": "6,6,6,6,6,4,4,4,4,4,4,4,4,4,4,4,2,2,2,2,2,2,2,2",
        "overall_danger_rose_image": "\/sites\/default\/files\/forecast\/201812\/20181230-064946-6.png",
        "overall_danger_rating": "Considerable",
        "Region": "Salt Lake"
      }
    }
  ]
}